Revit 2027 API
DockablePaneState.MinimumWidth Property
 When %dockPosition% is anything other than floating, the minimum width to use for the pane. Default is 200 pixels.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int MinimumWidth { get; set; }
Public Property MinimumWidth As Integer
	Get
	Set
public:
property int MinimumWidth {
	int get ();
	void set (int value);
}
member MinimumWidth : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for minimumWidth is not positive.
See Also
Reference
DockablePaneState Class
Autodesk.Revit.UI Namespace